Public Attributes | List of all members
API_StairMonolithStructureSymbolData Struct Reference
Element Manager API
>Represents the data of a monolith Stair's Structure elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_AttributeIndex  | goingLineType
short  | goingLinePen
short  | goingNosingLinePen
API_AttributeIndex  | goingNosingLineType
API_AttributeIndex  | connectionLineType
short  | connectionLinePen
short  | connectionDetailLinePen
API_AttributeIndex  | connectionDetailLineType
API_AttributeIndex  | drainingFillType
short  | drainingFillPen
short  | drainingFillBackGroundPen
API_AttributeIndex  | contourLineType
short  | contourLinePen
Detailed Description
>Represents the data of a monolith Stair's Structure elements.
Member Data Documentation
◆ connectionDetailLinePen
 short API_StairMonolithStructureSymbolData::connectionDetailLinePen
◆ connectionDetailLineType
 API_AttributeIndex API_StairMonolithStructureSymbolData::connectionDetailLineType
◆ connectionLinePen
 short API_StairMonolithStructureSymbolData::connectionLinePen
◆ connectionLineType
 API_AttributeIndex API_StairMonolithStructureSymbolData::connectionLineType
◆ contourLinePen
 short API_StairMonolithStructureSymbolData::contourLinePen
◆ contourLineType
 API_AttributeIndex API_StairMonolithStructureSymbolData::contourLineType
◆ drainingFillBackGroundPen
 short API_StairMonolithStructureSymbolData::drainingFillBackGroundPen
◆ drainingFillPen
 short API_StairMonolithStructureSymbolData::drainingFillPen
◆ drainingFillType
 API_AttributeIndex API_StairMonolithStructureSymbolData::drainingFillType
◆ goingLinePen
 short API_StairMonolithStructureSymbolData::goingLinePen
◆ goingLineType
 API_AttributeIndex API_StairMonolithStructureSymbolData::goingLineType
◆ goingNosingLinePen
 short API_StairMonolithStructureSymbolData::goingNosingLinePen
◆ goingNosingLineType
 API_AttributeIndex API_StairMonolithStructureSymbolData::goingNosingLineType